Revit 2024 API
SketchedStairsCurveData Class
 Sketched run/landing curves overrides with height and slope
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public class SketchedStairsCurveData : IDisposable
Visual Basic
Public Class SketchedStairsCurveData _
	Implements IDisposable
Visual C++
public ref class SketchedStairsCurveData : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SketchedStairsCurveData
See Also
SketchedStairsCurveData Members
Autodesk.Revit.DB Namespace